app/Controllers/Kelassiswa.php

SELECT *
FROM `kelas_siswa`
---
	public function getAll()
	{
		$response = $data['data'] = array();
		$db      = \Config\Database::connect();

		// $result = $this->kelassiswaModel->select()->findAll();
		$db      = \Config\Database::connect();
		$builder = $db->table('kelas_siswa');
		$builder->select('kelas_siswa.id,siswa.nisn,siswa.nis,siswa.nama_lengkap,kelas.nama_kelas,kelas.fase');
		$builder->join('siswa', 'siswa.id = kelas_siswa.id_siswa');
		$builder->join('kelas', 'kelas.id = kelas_siswa.id_kelas');
		$result = $builder->get();