app/Controllers/Pegawai.php

SELECT *
FROM `pegawai`
---
	public function getAll()
	{
 		$response = $data['data'] = array();

		$result = $this->pegawaiModel->select()->findAll();

SELECT *
FROM `pegawai`
WHERE `id` = '1'
 LIMIT 1
---
	public function getOne()
	{
 		$response = array();

		$id = $this->request->getPost('id');

		if ($this->validation->check($id, 'required|numeric')) {

			$data = $this->pegawaiModel->where('id' ,$id)->first();