app/Controllers/Ruangan.php

SELECT *
FROM `ruangan`
---
	public function getAll()
	{
 		$response = $data['data'] = array();

		$result = $this->ruanganModel->select()->findAll();

SELECT *
FROM `ruangan`
WHERE `id` = '3'
 LIMIT 1
---
	public function getOne()
	{
 		$response = array();

		$id = $this->request->getPost('id');

		if ($this->validation->check($id, 'required|numeric')) {

			$data = $this->ruanganModel->where('id' ,$id)->first();

INSERT INTO `ruangan` (`nama_ruang`, `kode_ruang`, `keterangan`) VALUES ('Ruang TU', 'R-005', 'Ruang Tata Usaha')
---
	public function add()
	{
        $response = array();

		$fields['id'] = $this->request->getPost('id');
$fields['nama_ruang'] = $this->request->getPost('nama_ruang');
$fields['kode_ruang'] = $this->request->getPost('kode_ruang');
$fields['keterangan'] = $this->request->getPost('keterangan');


        $this->validation->setRules([
			            'nama_ruang' => ['label' => 'Nama ruang', 'rules' => 'required|min_length[0]|max_length[30]'],
            'kode_ruang' => ['label' => 'Kode ruang', 'rules' => 'required|min_length[0]|max_length[10]'],
            'keterangan' => ['label' => 'Keterangan', 'rules' => 'required|min_length[0]|max_length[40]'],

        ]);

        if ($this->validation->run($fields) == FALSE) {

            $response['success'] = false;
			$response['messages'] = $this->validation->getErrors();//Show Error in Input Form

        } else {

            if ($this->ruanganModel->insert($fields)) {

UPDATE `ruangan` SET `nama_ruang` = 'Ruang Majlis Guru', `kode_ruang` = 'R-004', `keterangan` = 'Ruang Majlis Guru'
WHERE `ruangan`.`id` IN ('3')
---
	public function edit()
	{
        $response = array();

		$fields['id'] = $this->request->getPost('id');
$fields['nama_ruang'] = $this->request->getPost('nama_ruang');
$fields['kode_ruang'] = $this->request->getPost('kode_ruang');
$fields['keterangan'] = $this->request->getPost('keterangan');


        $this->validation->setRules([
			            'nama_ruang' => ['label' => 'Nama ruang', 'rules' => 'required|min_length[0]|max_length[30]'],
            'kode_ruang' => ['label' => 'Kode ruang', 'rules' => 'required|min_length[0]|max_length[10]'],
            'keterangan' => ['label' => 'Keterangan', 'rules' => 'required|min_length[0]|max_length[40]'],

        ]);

        if ($this->validation->run($fields) == FALSE) {

            $response['success'] = false;
			$response['messages'] = $this->validation->getErrors();//Show Error in Input Form

        } else {

            if ($this->ruanganModel->update($fields['id'], $fields)) {